#### Terraform Plan 📖
```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.cluster1_addons.helm_release.argocd[0] will be created
  + resource "helm_release" "argocd" {
      + atomic                     = false
      + chart                      = "argo-cd"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = (sensitive value)
      + namespace                  = "argocd"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://argoproj.github.io/argo-helm"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + take_ownership             = false
      + timeout                    = 300
      + upgrade_install            = false
      + values                     = []
      + verify                     = false
      + version                    = "7.3.6"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # module.cluster1_addons.helm_release.istio_base will be created
  + resource "helm_release" "istio_base" {
      + atomic                     = false
      + chart                      = "base"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = (sensitive value)
      + namespace                  = "istio-system"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://istio-release.storage.googleapis.com/charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + take_ownership             = false
      + timeout                    = 300
      + upgrade_install            = false
      + verify                     = false
      + version                    = "1.21.1"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # module.cluster1_addons.helm_release.istio_gateway[0] will be created
  + resource "helm_release" "istio_gateway" {
      + atomic                     = false
      + chart                      = "gateway"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = (sensitive value)
      + namespace                  = "istio-system"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://istio-release.storage.googleapis.com/charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + take_ownership             = false
      + timeout                    = 300
      + upgrade_install            = false
      + values                     = [
          + <<-EOT
                "labels":
                  "istio": "ingressgateway"
                  "istio.io/rev": "asm-managed"
                "revision": "asm-managed"
            EOT,
        ]
      + verify                     = false
      + version                    = "1.21.1"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # module.cluster1_addons.helm_release.istiod will be created
  + resource "helm_release" "istiod" {
      + atomic                     = false
      + chart                      = "istiod"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = (sensitive value)
      + namespace                  = "istio-system"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://istio-release.storage.googleapis.com/charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + take_ownership             = false
      + timeout                    = 300
      + upgrade_install            = false
      + values                     = [
          + <<-EOT
                "revision": "asm-managed"
            EOT,
        ]
      + verify                     = false
      + version                    = "1.21.1"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # module.cluster1_addons.kubernetes_manifest.istio_system will be created
  + resource "kubernetes_manifest" "istio_system" {
      + manifest = {
          + apiVersion = "v1"
          + kind       = "Namespace"
          + metadata   = {
              + labels = {
                  + "istio.io/rev" = "asm-managed"
                }
              + name   = "istio-system"
            }
        }
      + object   = {
          + apiVersion = "v1"
          + kind       = "Namespace"
          + metadata   = {
              + annotations                = (known after apply)
              + creationTimestamp          = (known after apply)
              + deletionGracePeriodSeconds = (known after apply)
              + deletionTimestamp          = (known after apply)
              + finalizers                 = (known after apply)
              + generateName               = (known after apply)
              + generation                 = (known after apply)
              + labels                     = (known after apply)
              + managedFields              = (known after apply)
              + name                       = "istio-system"
              + namespace                  = (known after apply)
              + ownerReferences            = (known after apply)
              + resourceVersion            = (known after apply)
              + selfLink                   = (known after apply)
              + uid                        = (known after apply)
            }
          + spec       = {
              + finalizers = (known after apply)
            }
        }

      + field_manager {
          + force_conflicts = true
          + name            = "terraform"
        }
    }

  # module.cluster2_addons.helm_release.argocd[0] will be created
  + resource "helm_release" "argocd" {
      + atomic                     = false
      + chart                      = "argo-cd"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = (sensitive value)
      + namespace                  = "argocd"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://argoproj.github.io/argo-helm"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + take_ownership             = false
      + timeout                    = 300
      + upgrade_install            = false
      + values                     = []
      + verify                     = false
      + version                    = "7.3.6"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # module.cluster2_addons.helm_release.istio_base will be created
  + resource "helm_release" "istio_base" {
      + atomic                     = false
      + chart                      = "base"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = (sensitive value)
      + namespace                  = "istio-system"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://istio-release.storage.googleapis.com/charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + take_ownership             = false
      + timeout                    = 300
      + upgrade_install            = false
      + verify                     = false
      + version                    = "1.21.1"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # module.cluster2_addons.helm_release.istio_gateway[0] will be created
  + resource "helm_release" "istio_gateway" {
      + atomic                     = false
      + chart                      = "gateway"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = (sensitive value)
      + namespace                  = "istio-system"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://istio-release.storage.googleapis.com/charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + take_ownership             = false
      + timeout                    = 300
      + upgrade_install            = false
      + values                     = [
          + <<-EOT
                "labels":
                  "istio": "ingressgateway"
                  "istio.io/rev": "asm-managed"
                "revision": "asm-managed"
            EOT,
        ]
      + verify                     = false
      + version                    = "1.21.1"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # module.cluster2_addons.helm_release.istiod will be created
  + resource "helm_release" "istiod" {
      + atomic                     = false
      + chart                      = "istiod"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = (sensitive value)
      + namespace                  = "istio-system"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://istio-release.storage.googleapis.com/charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + take_ownership             = false
      + timeout                    = 300
      + upgrade_install            = false
      + values                     = [
          + <<-EOT
                "revision": "asm-managed"
            EOT,
        ]
      + verify                     = false
      + version                    = "1.21.1"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # module.cluster2_addons.kubernetes_manifest.istio_system will be created
  + resource "kubernetes_manifest" "istio_system" {
      + manifest = {
          + apiVersion = "v1"
          + kind       = "Namespace"
          + metadata   = {
              + labels = {
                  + "istio.io/rev" = "asm-managed"
                }
              + name   = "istio-system"
            }
        }
      + object   = {
          + apiVersion = "v1"
          + kind       = "Namespace"
          + metadata   = {
              + annotations                = (known after apply)
              + creationTimestamp          = (known after apply)
              + deletionGracePeriodSeconds = (known after apply)
              + deletionTimestamp          = (known after apply)
              + finalizers                 = (known after apply)
              + generateName               = (known after apply)
              + generation                 = (known after apply)
              + labels                     = (known after apply)
              + managedFields              = (known after apply)
              + name                       = "istio-system"
              + namespace                  = (known after apply)
              + ownerReferences            = (known after apply)
              + resourceVersion            = (known after apply)
              + selfLink                   = (known after apply)
              + uid                        = (known after apply)
            }
          + spec       = {
              + finalizers = (known after apply)
            }
        }

      + field_manager {
          + force_conflicts = true
          + name            = "terraform"
        }
    }

  # module.gke_clusters.google_container_node_pool.node_pools["cluster-1"] will be updated in-place
  ~ resource "google_container_node_pool" "node_pools" {
        id                          = "projects/infra-474223/locations/us-central1-a/clusters/cluster-1/nodePools/cluster-1-node-pool"
        name                        = "cluster-1-node-pool"
      ~ node_count                  = 4 -> 1
        # (9 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.gke_clusters.google_container_node_pool.node_pools["cluster-2"] will be updated in-place
  ~ resource "google_container_node_pool" "node_pools" {
        id                          = "projects/infra-474223/locations/us-east1-b/clusters/cluster-2/nodePools/cluster-2-node-pool"
        name                        = "cluster-2-node-pool"
      ~ node_count                  = 4 -> 1
        # (9 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

Plan: 10 to add, 2 to change, 0 to destroy.

```
*Pusher: @gabaws, Action: `pull_request`*